Vladimir-Trufanov/ittve-ESP32/07-rabota-s-sajtami-v-seti-wifi/WiFiScan/ChipWiFi.h
/** Arduino, ESP32, C/C++ ************************************** ChipWiFi.h ***
 * 
 *                          Обеспечить сканирование сетей WiFi, выбор и ведение 
 *                           локальной сети WiFi и собственной сети контроллера 
 *                                                     
 * v1.0.2, 20.03.2026                                 Автор:      Труфанов В.Е.
 * Copyright © 2026 tve                               Дата создания: 18.03.2026
**/

#pragma once     

#include "WiFi.h"

// Определяем SSID собственной сети контроллера
#ifndef soft_ap_ssid
  #define soft_ap_ssid "Esp-DachaSad" 
#endif
// Формируем данные массива учетных записей возможных локальных сетей
int enarr = 6;         // число элементов в массиве
const char* esarr[] =  // массив учетных данных
{
  "tve-DESKTOP",   "Ue14-328",
  "OPPO A9 2020",  "b277a4ee84e8",
  "tve-MONOBLOCK", "Ue17-647",
};

// Резервируем параметры для выбираемой сети
char essid[16] = {0};       // идентификатор беспроводной сети
char epassword[16] = {0};   // пароль
int eRSSI = -999;           // уровень принимаемого сигнала (дБм - децибел на милливатт) 

// Просканировать, показать сети WiFi в диапазоне и выбрать с большим RSSI 
bool ViewWiFi(const char* sarr[]=esarr, int narr=enarr); 
// Просканировать сети WiFi в диапазоне по списку и выбрать подходящую для подключения 
bool ScanWiFi(const char* sarr[], int narr); 
// Проверить соответствие заданному ssid одной из сетей WiFi и выбрать сеть для подключения 
bool findWiFi(const char* ssid, int iRSSI, const char* sarr[], int narr);
// Инициировать работу контроллера, как станции WiFi и с собственной сетью
void InitWiFi(const char* ssid, const char* password);

// ****************************************************************************
// *     Проверить соответствие заданному ssid одной из сетей WiFi, которые   *
// *      может использовать контроллер и выбрать эту сеть для подключения    *
// *        [essid,epassword], если уровень сигнала превышает ранее           *
// *                    зафиксированный уровень другой сети                   *
// ****************************************************************************
bool findWiFi(const char* ssid, int iRSSI, const char* sarr[], int narr) 
{
  bool result=false;
  for (int i = 0; i < narr; i=i+2) 
  {
    //Serial.print("Смотри: "); Serial.print(iRSSI); Serial.print(" "); Serial.print(sarr[i]); Serial.print(" => ");  Serial.println(sarr[i+1]);
    int res = strcmp(sarr[i], ssid);
    if (res == 0) 
    {
      //Serial.print("Совпал: "); Serial.print(iRSSI); Serial.print(" "); Serial.print(sarr[i]); Serial.print(" => ");  Serial.println(sarr[i+1]);
      if (((strlen(sarr[i]))<16) || ((strlen(sarr[i]))<16))
      {
        //Serial.print("Годен:  "); Serial.print(iRSSI); Serial.print(" "); Serial.print(sarr[i]); Serial.print(" => ");  Serial.println(sarr[i+1]);
        //Serial.print("Было:   "); Serial.print(eRSSI); Serial.print(" "); Serial.print(essid);   Serial.print(" => ");  Serial.println(epassword);
        if (iRSSI>eRSSI)
        {
          // essid[16] = {0};
          // Serial.print(essid); Serial.print(" 0=> ");  Serial.println(epassword);
          strncpy(essid, sarr[i], sizeof(essid) - 1); 
          // epassword[16] = {0};
          strncpy(epassword, sarr[i+1], sizeof(epassword) - 1); 
          eRSSI=iRSSI;
          //Serial.print("Стало:  "); Serial.print(eRSSI); Serial.print(" "); Serial.print(essid);   Serial.print(" => ");  Serial.println(epassword);
          result=true;
          break;
        }
      }
    }
  }
  return result; 
}
// ****************************************************************************
// *              Просканировать сети WiFi в диапазоне по списку и            *
// *                     выбрать подходящую для подключения                   *
// ****************************************************************************
void SerialDefis()
{
  Serial.println("--------------------------------------------------------------");
}
bool ScanWiFi(const char* sarr[], int narr) 
{
  // Отмечаем, что подходящая сеть ещё не найдена
  bool isnetwifi=false;
  //Serial.println("Начато сканирование сетей WiFi");
  int n = WiFi.scanNetworks(); // получили количество найденных сетей
  //Serial.println("Сканирование завершено");
  if (n == 0) 
  {
    Serial.println("Сетей не найдено");
  } 
  else 
  {
    //Serial.print(n); Serial.println(": столько сетей найдено");
    Serial.println("№  | SSID                             | RSSI | CH | Encryption");
    for (int i = 0; i < n; ++i) 
    {
      // Выводим данные текущей сети
      Serial.printf("%2d", i + 1);
      Serial.print(" | ");
      Serial.printf("%-32.32s", WiFi.SSID(i).c_str());
      Serial.print(" | ");
      Serial.printf("%4ld", WiFi.RSSI(i));
      Serial.print(" | ");
      Serial.printf("%2ld", WiFi.channel(i));
      Serial.print(" | ");
      switch (WiFi.encryptionType(i)) 
      {
        case WIFI_AUTH_OPEN:            Serial.print("open"); break;
        case WIFI_AUTH_WEP:             Serial.print("WEP"); break;
        case WIFI_AUTH_WPA_PSK:         Serial.print("WPA"); break;
        case WIFI_AUTH_WPA2_PSK:        Serial.print("WPA2"); break;
        case WIFI_AUTH_WPA_WPA2_PSK:    Serial.print("WPA+WPA2"); break;
        case WIFI_AUTH_WPA2_ENTERPRISE: Serial.print("WPA2-EAP"); break;
        case WIFI_AUTH_WPA3_PSK:        Serial.print("WPA3"); break;
        case WIFI_AUTH_WPA2_WPA3_PSK:   Serial.print("WPA2+WPA3"); break;
        case WIFI_AUTH_WAPI_PSK:        Serial.print("WAPI"); break;
        default:                        Serial.print("unknown");
      }
      Serial.println();
      // Отмечаем, если выбрана подходящая сеть
      bool isWiFi=findWiFi(WiFi.SSID(i).c_str(),WiFi.RSSI(i),sarr,narr);
      if (isWiFi) 
      {
        Serial.print("Можно подключиться: ");
        Serial.print(essid); Serial.print(" => "); Serial.print(epassword); Serial.print(" = ");  Serial.println(eRSSI);
        isnetwifi=true;
      }
      delay(10);
    }
  }
  // Удаляем результат сканирования, чтобы освободить память
  WiFi.scanDelete();
  SerialDefis();
  return isnetwifi;
}
// ****************************************************************************
// *  Просканировать, показать сети WiFi в диапазоне и выбрать с большим RSSI *
// ****************************************************************************
bool ViewWiFi(const char* sarr[], int narr)
{
  bool iswifiview;
  // Трассируем итоговый массив учетных записей возможных локальных сетей
  /*
  for (int i = 0; i < narr; ++i) 
  {
   Serial.println(sarr[i]);
  }
  */
  // Переводим Wi-Fi в режим станции и отключаемся от точки доступа, если она была подключена
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  // Ждем немного перед сканированием
  delay(1000);
  // Для ранних версий ESP_IDF не выделяем отдельных диапазонов
  SerialDefis();
  Serial.println("Отсканированные сети Wi-Fi:");
  SerialDefis();
  // Для поздних версий ESP_IDF указываем автоматический выбор диапазона 
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 2)
    WiFi.setBandMode(WIFI_BAND_MODE_AUTO);
  #endif
  iswifiview=ScanWiFi(sarr,narr);
  // Для поздних версий ESP_IDF с поддержкой 5G вначале выбираем диапазон 2.4 Ghz 
  #if CONFIG_SOC_WIFI_SUPPORT_5G
    delay(1000);
    SerialDefis();
    Serial.println("Отсканированные сети в диапазоне WiFi 2,4 ГГц:");
    SerialDefis();
    WiFi.setBandMode(WIFI_BAND_MODE_2G_ONLY);
    iswifiview=ScanWiFi(sarr,narr);
    delay(1000);
    // Затем выбираем диапазон 5 Ghz 
    SerialDefis();
    Serial.println("Отсканированные сети в диапазоне WiFi 5 ГГц");
    SerialDefis();
    WiFi.setBandMode(WIFI_BAND_MODE_5G_ONLY);
    iswifiview=ScanWiFi(sarr,narr);
  #endif
  //if (iswifiview) Serial.println("Точно сеть найдена!");
  //else Serial.println("Точно сеть НЕ найдена!");
  return iswifiview;
}
// ****************************************************************************
// *   Инициировать работу контроллера, как станции WiFi и с собственной сетью  *
// ****************************************************************************
void InitWiFi(const char* ssid, const char* password)
{
  // Переключаем контроллер в режим работы с собственной сетью и как станции

  WiFi.mode(WIFI_MODE_APSTA);
  // Создаём собственную сеть
  WiFi.softAP(soft_ap_ssid,soft_ap_ssid);
  // Подключаемся к WiFi
  WiFi.begin(ssid,password);
  // Отключаем режим сна (modem sleep). 
  WiFi.setSleep(false);
  Serial.print("Подключение к WiFi ");
  while (WiFi.status() != WL_CONNECTED) 
  {
    delay(500);
    Serial.print(".");
  }
  Serial.println("");
  Serial.println("WiFi подключен");
  Serial.print("IP собственной сети: ");  Serial.print(WiFi.softAPIP()); Serial.print("  "); Serial.println(soft_ap_ssid);
  Serial.print("IP рабочей станции:  ");  Serial.print(WiFi.localIP());  Serial.print("  "); Serial.println(ssid);
}

// ************************************************************* ChipWiFi.h ***
